In [8]:
import pandas as pd
import numpy  as np
from numpy import nan as NA

In [4]:
%config Completer.use_jedi = False

In [6]:
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [10]:
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [26]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], 
                   [NA, NA, NA], [NA, 6.5, 3.]])

cleaned = data.dropna(how='all', axis=1)
print("data")
data

data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [27]:
print("cleaned")
cleaned

cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [28]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.965176       NaN       NaN
1  0.093709       NaN       NaN
2 -0.082445       NaN -0.103071
3 -0.656162       NaN  0.342982
4 -1.756595  0.147136  0.437612
5  0.740090 -0.456767  0.929783
6  1.131248  0.989707 -0.251774

In [32]:
df.dropna()

          0         1         2
4 -1.756595  0.147136  0.437612
5  0.740090 -0.456767  0.929783
6  1.131248  0.989707 -0.251774

In [37]:
df.dropna(thresh=2)

          0         1         2
2 -0.082445       NaN -0.103071
3 -0.656162       NaN  0.342982
4 -1.756595  0.147136  0.437612
5  0.740090 -0.456767  0.929783
6  1.131248  0.989707 -0.251774

In [38]:
df.fillna(0)

          0         1         2
0  0.965176  0.000000  0.000000
1  0.093709  0.000000  0.000000
2 -0.082445  0.000000 -0.103071
3 -0.656162  0.000000  0.342982
4 -1.756595  0.147136  0.437612
5  0.740090 -0.456767  0.929783
6  1.131248  0.989707 -0.251774

In [39]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.965176  0.500000  0.000000
1  0.093709  0.500000  0.000000
2 -0.082445  0.500000 -0.103071
3 -0.656162  0.500000  0.342982
4 -1.756595  0.147136  0.437612
5  0.740090 -0.456767  0.929783
6  1.131248  0.989707 -0.251774

In [42]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  0.965176  0.000000  0.000000
1  0.093709  0.000000  0.000000
2 -0.082445  0.000000 -0.103071
3 -0.656162  0.000000  0.342982
4 -1.756595  0.147136  0.437612
5  0.740090 -0.456767  0.929783
6  1.131248  0.989707 -0.251774

In [43]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.782469 -0.651197 -1.627257
1 -0.352657  0.628734  1.125549
2  0.720660       NaN  0.365853
3 -0.195098       NaN  0.733013
4 -0.174354       NaN       NaN
5  0.947939       NaN       NaN

In [44]:
df.fillna(method='ffill')

          0         1         2
0 -0.782469 -0.651197 -1.627257
1 -0.352657  0.628734  1.125549
2  0.720660  0.628734  0.365853
3 -0.195098  0.628734  0.733013
4 -0.174354  0.628734  0.733013
5  0.947939  0.628734  0.733013

In [45]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.782469 -0.651197 -1.627257
1 -0.352657  0.628734  1.125549
2  0.720660  0.628734  0.365853
3 -0.195098  0.628734  0.733013
4 -0.174354       NaN  0.733013
5  0.947939       NaN  0.733013

In [46]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64